Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo Class
The TeklaStructuresInfo class provides information about Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.TeklaStructuresInfo
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class TeklaStructuresInfo
Public NotInheritable Class TeklaStructuresInfo
The TeklaStructuresInfo type exposes the following members.
Constructors
Name | Description
TeklaStructuresInfo
Initializes a new instance of the TeklaStructuresInfo class
Top
Methods
Name | Description
GetBuildNumber
 Returns the Tekla Structures build number.
GetCommonAppDataFolder
 Returns (XSDATADIR)environments installation folder of the Tekla Structures as string.
GetCopyRightText
 Returns the Tekla Structures copyright text as string.
GetCurrentProgramVersion
 Returns the current Tekla Structures version.
GetCurrentUser
 Returns the current Tekla Structures user.
GetFullTSRegistryKeyText
Returns full registry key of the Tekla Structures as string.
GetLocalAppDataFolder
 Returns (XSUSERDATADIR) user's local appdata folder of the Tekla Structures as string.
GetPluginsFolder
 Returns main TS plugins folder, not extensions folder
GetRevisionDate
 Returns the Tekla Structures revision date as string.
Top
See Also
Reference
Tekla.Structures Namespace